In [4]:
# 一行生成列表
item = [1, 2, 3, 4]
[i*i for i in item]

[1, 4, 9, 16]

In [5]:
# lambda 由一行表达式构成的函数 不用 def return
square = lambda x: x**2
square(3)

9

In [9]:
# map 对整个列表进行一种函数操作
# map(func, *iterables)
seq = [1, 2, 3, 4, 5]
list(map(lambda var: var**2, seq))

[1, 4, 9, 16, 25]

In [12]:
# Filter 对列表进行筛选
# filter(function or None, iterable)
seq = [1, 2, 3, 4, 5]
list(filter(lambda x: x> 2, seq))

[3, 4, 5]

In [24]:
# numpy 中的 arang 和 linspace 的区别
import numpy as np
# arange([start,] stop[, step,], dtype=None)
# arange() 函数按照指定的步长返回一个等差数列
np.arange(1, 10, 2)

array([1, 3, 5, 7, 9])

In [25]:
# np.linspace(start, stop, num=50, endpoint=True, retstep=False, dtype=None)
# linspace() 返回的是将给定区间进行若干等分以后的等分点组成的数列。
np.linspace(1, 100, num=10, dtype=int)

array([  1,  12,  23,  34,  45,  56,  67,  78,  89, 100])

In [48]:
# 用 Concat、Merge 和 Join 来合并数据表
import pandas as pd
d = {'A': ['A'+str(i) for i in range(4)], 'B': ['B'+str(i) for i in range(4)],
     'C': ['C'+str(i) for i in range(4)], 'D': ['D'+str(i) for i in range(4)]}
df1 = pd.DataFrame(d)
d = {'A': ['A'+str(i+4) for i in range(4)], 'B': ['B'+str(i+4) for i in range(4)],
     'C': ['C'+str(i+4) for i in range(4)], 'D': ['D'+str(i+4) for i in range(4)]}
df2 = pd.DataFrame(d)
print(df1, df2, sep='\n')

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
    A   B   C   D
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [45]:
pd.concat([df1, df2], axis=0)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [52]:
# Apply 函数
# 这个函数是专为 Pandas 的数据表和 series 对象打造的。
df = pd.DataFrame([[4, 9]]*3, columns=['A', 'B'])
df

   A  B
0  4  9
1  4  9
2  4  9

In [53]:
df.apply(np.sqrt)

     A    B
0  2.0  3.0
1  2.0  3.0
2  2.0  3.0

In [56]:
df.apply(np.sum, axis=0)

A    12
B    27
dtype: int64

In [57]:
df.apply(np.sum, axis=1)

0    13
1    13
2    13
dtype: int64

In [68]:
# 数据透视表（Pivot Tables）
# Excel 里的“数据透视表”功能。Pandas 里内建的 pivot_table() 函数的功能也差不多，它能帮你对一个数据表进行格式化，并输出一个像 Excel 工作表一样的表格
df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
                       "bar", "bar", "bar", "bar"],
                    "B": ["one", "one", "one", "two", "two",
                      "one", "one", "two", "two"],
                     "C": ["small", "large", "large", "small",
                      "small", "large", "small", "small",
                     "large"],
                   "D": [1, 2, 2, 3, 3, 4, 5, 6, 7]})
df

     A    B      C  D
0  foo  one  small  1
1  foo  one  large  2
2  foo  one  large  2
3  foo  two  small  3
4  foo  two  small  3
5  bar  one  large  4
6  bar  one  small  5
7  bar  two  small  6
8  bar  two  large  7

In [72]:
df.pivot_table(values='D', index=['A', 'B'],columns=['C'], aggfunc=np.sum)

C        large  small
A   B
bar one    4.0    5.0
    two    7.0    6.0
foo one    4.0    1.0
    two    NaN    6.0